In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

salary_df = pd.read_csv('../data/01_raw/salary.csv')
people_df = pd.read_csv('../data/01_raw/people.csv')
descriptions_df = pd.read_csv('../data/01_raw/descriptions.csv')

In [8]:
print(f"Dataset shape: {salary_df.shape}")
salary_df.head()

Dataset shape: (375, 2)

   id    Salary
0   0   90000.0
1   1   65000.0
2   2  150000.0
3   3   60000.0
4   4  200000.0

In [9]:
salary_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 375 entries, 0 to 374
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      375 non-null    int64
 1   Salary  373 non-null    float64
dtypes: float64(1), int64(1)
memory usage: 6.0 KB

Two null salary -> Remove in the data processing steps

In [10]:
salary_df.describe()

               id         Salary
count  375.000000     373.000000
mean   187.000000  100577.345845
std    108.397417   48240.013482
min      0.000000     350.000000
25%     93.500000   55000.000000
50%    187.000000   95000.000000
75%    280.500000  140000.000000
max    374.000000  250000.000000

In [11]:
print(f"Dataset shape: {people_df.shape}")
people_df.head()

Dataset shape: (375, 6)

   id   Age  Gender Education Level          Job Title  Years of Experience
0   0  32.0    Male      Bachelor's  Software Engineer                  5.0
1   1  28.0  Female        Master's       Data Analyst                  3.0
2   2  45.0    Male             PhD     Senior Manager                 15.0
3   3  36.0  Female      Bachelor's    Sales Associate                  7.0
4   4  52.0    Male        Master's           Director                 20.0

We can join data using 'id' variable

In [12]:
people_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 375 entries, 0 to 374
Data columns (total 6 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   id                   375 non-null    int64
 1   Age                  370 non-null    float64
 2   Gender               370 non-null    object
 3   Education Level      370 non-null    object
 4   Job Title            370 non-null    object
 5   Years of Experience  373 non-null    float64
dtypes: float64(2), int64(1), object(3)
memory usage: 17.7+ KB

We have some NA's or NULL data

In [13]:
print(f"Dataset shape: {descriptions_df.shape}")
descriptions_df.head()

Dataset shape: (375, 2)

   id                                        Description
0   0  I am a 32-year-old male working as a Software ...
1   1  I am a 28-year-old data analyst with a Master'...
2   2  I am a 45-year-old Senior Manager with a PhD a...
3   3  I am a 36-year-old female Sales Associate with...
4   4  I am a 52-year-old male with over two decades ...